_posts/2019-01-22-Typed-vs-Dynamic-Programming-Languages.html
---
title: Typed vs Dynamic Programming Languages
tags: programming
---
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgea1c442">1. Pros and Cons</a></li>
<li><a href="#org8184efd">2. The Cycle</a></li>
<li><a href="#org4873932">3. Know what you use and why you use it</a></li>
</ul>
</div>
</nav>
<div id="outline-container-orgea1c442" class="outline-2">
<h2 id="orgea1c442"><span class="section-number-2">1</span> Pros and Cons</h2>
<div class="outline-text-2" id="text-1">
<p>
Those days I work a lot in the Javascript world and Typescript—a typed
version of javascript—is becoming more and more popular. Some of my
coworkers also promote it strongly and they can not see the point of
using a dynamic language anymore.
</p>

<p>
Usually those are the selling points:
</p>
<ul class="org-ul">
<li>The extra security provided by types is to be too be important to be passed on.</li>
<li>Types help with refactoring.</li>
<li>Types make it easier to provide better programming tools.</li>
</ul>

<p>
Pro dynamic languages programmers will usually tell you that with
dynamic languages:
</p>
<ul class="org-ul">
<li>It is easier to get started</li>
<li>You have less constraints on dependencies.</li>
<li>Deployment is easier</li>
</ul>

<p>
Those are valid points. More importantly, it seems there is always a cycle
between typed languages and dynamic languages. And this cycle, this
<b>repeating history</b> seems more important as it illustrates the
real life benefits of both.
</p>
</div>
</div>

<div id="outline-container-org8184efd" class="outline-2">
<h2 id="org8184efd"><span class="section-number-2">2</span> The Cycle</h2>
<div class="outline-text-2" id="text-2">
<p>
Lets imagine the life of Mr IKnowNothing. Mr IKnowNothing starts his
career as a novice programmer. As he starts on his first job he uses
`Haskell`. He starts writing some code and he is very happy as the
`Haskell` compiler helps correct his program as he writes it.
He could never consider writing something in a non-typed language as
the types are helping him so much.
</p>

<p>
However after some times, Mr IKnowNothing discovers that there are
still some bugs in his program. For example consider
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="font-weight: bold;">addTwo</span> :: Integer -&gt; Integer
<span style="font-weight: bold;">addTwo</span> x = x + 1

<span style="font-weight: bold;">addTwo</span> 2
</pre>
</div>

<p>
This is perfectly valid Haskell, it compiles, however Mr IKnowNothing
made a typo and it adds 1 instead of 2.
</p>

<p>
Mr IKnowNothing is pretty disappointed so he decides to start writing
some tests as he programs to validate even more his work. Eventually
as he becomes more skilled he writes more and more tests and with less
and less bugs. All is fine except that he has a breakthrough.
</p>

<p>
If I need to write tests for all of my code anyway, why should I use
types? Could I not just use dynamic languages? If I have enough tests
I don't need all of those type annotations and I can write and deploy
programs even faster.
</p>

<p>
So Mr IKnowNothing starts using a dynamic programming language. He
tests extensively his code. He deploys. Everything works, he has never
been so productive. Everything is fine, at least for a time…
</p>

<p>
Here comes a new Hire, Miss IWantToLearn. Miss IWantToLearn is a
beginner programmer just as was Mr IKnowNothing. And Mr IKnowNothing
is pretty disappointed with Miss IWantToLearn. She makes so many
mistakes!
</p>

<p>
Well let me say this. Mr IKnowNothing is very unfair. Miss
IWantToLearn did not have time to learn how to program with the
protection of a typed language. Of course she is going to make a lot
of mistakes. Mr IKnowNothing still makes a lot of mistakes after all.
</p>

<p>
As a natural side effect Miss IWantToLearn is very dissapointed with
this dynamic programming language. Also at this recent meetup she has
learned about this cool typed language called `Rust` and it seems that
`Rust` is a very safe language. There is no way she will use anything
else than a typed language from now on.
</p>
</div>
</div>

<div id="outline-container-org4873932" class="outline-2">
<h2 id="org4873932"><span class="section-number-2">3</span> Know what you use and why you use it</h2>
<div class="outline-text-2" id="text-3">
<p>
My advice is: you now know this evil circle, <b>break it</b>. Be aware of
which kind of programming language you use and why you use it.
</p>

<p>
For example:
</p>

<ul class="org-ul">
<li>If I were to go on Mars with my life depending on my</li>
</ul>
<p>
software I would use typed programming with an extensive suite of
tests.
</p>
<ul class="org-ul">
<li>Most of my coworkers are less experienced than me? Let's use typed
programming as it will help them. At the same time let's introduce
them to testing.</li>
<li>You are an expert team of 3 or 5 programmers? Use a dynamic language
and use it to ship something quicky. If your tests are good enough
it will work!</li>
</ul>

<p>
Of course there are variations around this theme and there are
different ways to `test` your program but this is the gist of the
problem.
</p>

<p>
Move away from people that don't really understand the two
alternatives and chose the correct programming language best on your
team strengths.
</p>
</div>
</div>
